app/controllers/customers_controller.rb

    def set_customer
      @customer = @veterinary.customers.find(params[:id])
---
SELECT "customers".* FROM "customers" WHERE "customers"."veterinary_id" = $1  [["veterinary_id", 1]]